/* 
   Main-GM.strings
   MobileSlideShow

   Created by Hernan Eguiluz on 11/30/10.
   Copyright 2010 Apple Inc. All rights reserved.
 */


/*** Sharing and Action Button Labels ***/

PHOTOSTREAM_SAVE_TO_CAMERAROLL = "Save to Camera Roll";
PHOTOSTREAM_SAVE_TO_SAVEDPHOTOS = "Save to Saved Photos";

/* Editing albums */
"MOVE_TO_EXISTING_ALBUM" = "Move to Existing Album";
"ADD_TO_EXISTING_ALBUM" = "Add to Existing Album";
"ADD_TO_ALBUM" = "Add to Album";
"ADD_TO_NEW_ALBUM" = "Add to New Album";
"CREATE_ALBUM_ALERT_TITLE" = "New Album"; 
"CREATE_ALBUM_ALERT_MESSAGE" = "Enter a name for this album.";
"CREATE_ALBUM_SAVE_BUTTON_TITLE" = "Save";
"CREATE_ALBUM_TITLE_PLACEHOLDER" = "Title";

"DELETE_ALBUM_CONFIRMATION_MESSAGE_0" = "Are you sure you want to delete the album “%@”?";
"DELETE_ALBUM_CONFIRMATION_MESSAGE_1" = "Are you sure you want to delete the album “%@”? The photos will not be deleted.";
"DELETE_ALBUM_CONFIRMATION_MESSAGE_n" = "Are you sure you want to delete the album “%@”? The photos will not be deleted.";
"DELETE_ALBUM_CONFIRMATION_ALERT_BUTTON_TITLE" = "Delete";
"DELETE_ALBUM_CONFIRMATION_SHEET_BUTTON_TITLE" = "Delete Album";
"DELETE_ALBUM_CONFIRMATION_ALERT_TITLE" = "Delete “%@”";

"SELECT_ALL_PHOTOS_BUTTON" = "Select All Photos";
"DESELECT_ALL_PHOTOS_BUTTON" = "Deselect All Photos";

"ADD_ITEMS_PICKER_PROMPT_0" = "Add photos to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_1_PHOTO" = "Add %@ photo to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_n_PHOTO" = "Add %@ photos to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_1_VIDEO" = "Add %@ video to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_n_VIDEO" = "Add %@ videos to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_1_AUDIO" = "Add %@ audio clip to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_n_AUDIO" = "Add %@ audio clips to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_1_ITEM" = "Add %@ item to “%@”.";
"ADD_ITEMS_PICKER_PROMPT_n_ITEM" = "Add %@ items to “%@”.";

/*** Full Screen Edit ***/

EDIT_PHOTO_TITLE    = "Edit Photo";
CROP_PHOTO_TITLE    = "Crop Photo";        // iPhone
CROP_STRAIGHTEN_TITLE = "Crop and Straighten";      // iPad
RED_EYE_TITLE       = "Remove Red-Eye";

REVERT_TO_ORIGINAL  = "Revert to Original";
UNDO                = "Undo";

// Save-Done button title.

APPLY_RED_EYE_TITLE     = "Apply";
APPLY_CROP_TITLE        = "Crop";
SAVE_ADJUSTMENTS_TITLE  = "Save";

// Button titles.

ENHANCE             = "Enhance";
RED_EYE             = "Red-Eye";
ROTATE              = "Rotate";
CROP                = "Crop";
CONSTRAIN_TITLE     = "Constrain";
RESET_TITLE         = "Reset";

// Undo-Redo action names.

REVERT_ORIGINAL_ACTION  = "Revert to Original Photo";
REVERT_SAVED_ACTION     = "Revert to Saved Photo";              // Note: Button is labeled "Reset".
ROTATE_ACTION           = "Rotate Photo";
CROP_ACTION             = "Crop Photo";
RED_EYE_ACTION          = "Red-Eye Correction";
ADD_RED_EYE_CORRECTION  = "Add Red-Eye Correction";
REMOVE_RED_EYE_CORRECTION  = "Remove Red-Eye Correction";
ENHANCE_ACTION          = "Enhance Photo";

// Aspect ratio labels.

ORIGINAL_ASPECT_RATIO   = "Original";
SQUARE_ASPECT_RATIO     = "Square";
GENERIC_ASPECT_RATIO    = "%1$@ × %2$@";      // %1 is the width. %2 is the height. Be sure to use a cross, "×", not letter "X".

// Message overlay text.

AUTO_ENHANCE_ON_MESSAGE = "Auto-Enhance On";
AUTO_ENHANCE_OFF_MESSAGE = "Auto-Enhance Off";

// Red-Eye Correction

RED_EYE_MESSAGE     = "Tap each red-eye. Tap again to undo.";
SAVE_EDITS_MESSAGE  = "Save the edited version of this photo in your Camera Roll.";
DID_NOT_FIND_RED_EYE_MESSAGE = "Did not find a red-eye to correct.";

CANCEL_CORRECTIONS_TITLE    = "Cancel in-progress red-eye corrections?";
CANCEL_CORRECTIONS_MESSAGE  = "Red-eyes are being corrected. Continuing will cancel those corrections.";

/*** Camera ***/

PANO_OPTION = "Panorama";
SAVING_PANORAMA = "Saving Panorama";
CANCEL_PANO_BUTTON_TITLE = "Cancel";
DONE_PANO_BUTTON_TITLE = "Done";
PANO_CAPTURE_TEXT = "Capture Panorama from left to right.";
PANO_BEGIN_TEXT = "Tap the Camera button to begin.";
PANO_ARROW_TEXT = "Keep the arrow on the centre line.";
